Revit 2027 API
AnalyticalMember.SetReleaseConditions Method
 Sets Release Conditions to Analytical Member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetReleaseConditions(
	ReleaseConditions releaseConditions
)
Public Sub SetReleaseConditions (
	releaseConditions As ReleaseConditions
)
public:
void SetReleaseConditions(
	ReleaseConditions^ releaseConditions
)
member SetReleaseConditions :
        releaseConditions : ReleaseConditions -> unit
Parameters
releaseConditions ReleaseConditions
 End to which release conditions will be added is defined by setting [!:Autodesk::Revit::DB::Structure::ReleaseConditions::Position] property in provided release conditions object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If element already have release conditions defined for that end, newly provided values replace current one. The ReleaseType will be set to UserDefined.
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace